In [1]:
import numpy as np
import pandas as pd

In [11]:
labels=['w','x','y','z']
list=[10,20,30,40]
dict={'w':10,'x':20,'y':30,'z':40}

In [10]:
pd.Series(data=list,index=labels)

w    10
x    20
y    30
z    40
dtype: int64

In [7]:
array=np.array(list)

In [8]:
pd.Series(array,labels)

w    10
x    20
y    30
z    40
dtype: int32

In [12]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [13]:
sports=pd.Series([1,2,3,4],index=['cricket','football','snooker','hockey'])

In [14]:
sports['cricket']

1

In [70]:
from numpy.random import randn
np.random.seed(1)

In [125]:
df=pd.DataFrame(randn(10,5),index=['A','B','C','D','E','G','H','I','J','K'],columns=['Score1','Score2','Score3','Score4','Score5'])

In [126]:
df[['Score1','Score2']]

     Score1    Score2
A  0.300170 -0.352250
B  0.586623  0.838983
C -0.754398  1.252868
D -0.075572  1.131629
E -1.444114 -0.504466
G -2.022201 -0.306204
H -0.222328 -0.200758
I  0.119009 -0.670662
J  1.198918  0.185156
K  0.077340 -0.343854

In [127]:
df.drop('Score5',axis=1,inplace=True)

In [128]:
df.loc['J']

Score1    1.198918
Score2    0.185156
Score3   -0.375285
Score4   -0.638730
Name: J, dtype: float64

In [129]:
df.iloc[6]

Score1   -0.222328
Score2   -0.200758
Score3    0.186561
Score4    0.410052
Name: H, dtype: float64

In [130]:
df.loc[['J','K'],:]

     Score1    Score2    Score3    Score4
J  1.198918  0.185156 -0.375285 -0.638730
K  0.077340 -0.343854  0.043597 -0.620001

In [131]:
df.iloc[0:6:2,0:4:2]

     Score1    Score3
A  0.300170 -1.142518
C -0.754398  0.512930
E -1.444114  0.160037

In [132]:
df>0.5

   Score1  Score2  Score3  Score4
A   False   False   False   False
B    True    True    True   False
C   False    True    True   False
D   False    True    True    True
E   False   False   False    True
G   False   False    True   False
H   False   False   False   False
I   False   False   False   False
J    True   False   False   False
K   False   False   False   False

In [133]:
df[df>0.5]

     Score1    Score2    Score3    Score4
A       NaN       NaN       NaN       NaN
B  0.586623  0.838983  0.931102       NaN
C       NaN  1.252868  0.512930       NaN
D       NaN  1.131629  1.519817  2.185575
E       NaN       NaN       NaN  0.876169
G       NaN       NaN  0.827975       NaN
H       NaN       NaN       NaN       NaN
I       NaN       NaN       NaN       NaN
J  1.198918       NaN       NaN       NaN
K       NaN       NaN       NaN       NaN

In [134]:
df[df['Score2']>0.5]['Score1']

B    0.586623
C   -0.754398
D   -0.075572
Name: Score1, dtype: float64

In [137]:
df[df['Score2']>0.5][['Score1','Score4']]

     Score1    Score4
B  0.586623  0.285587
C -0.754398 -0.298093
D -0.075572  2.185575

In [74]:
df[(df['Score2']>0.5)& (df['Score2']<1)]

Empty DataFrame
Columns: [Score1, Score2, Score3, Score4, Score5]
Index: []

In [49]:
df[df['Score2']>1]['Score1']

A   -0.447129
G    1.236164
Name: Score1, dtype: float64

In [59]:
df=pd.DataFrame({'Cricket':[1,2,3,np.NaN,5],'Hockey':[1,2,4,5,6],'FootBall':[1,2,3,4,np.NaN]})

In [60]:
df

   Cricket  Hockey  FootBall
0      1.0       1       1.0
1      2.0       2       2.0
2      3.0       4       3.0
3      NaN       5       4.0
4      5.0       6       NaN

In [62]:
df.dropna(thresh=2)

   Cricket  Hockey  FootBall
0      1.0       1       1.0
1      2.0       2       2.0
2      3.0       4       3.0
3      NaN       5       4.0
4      5.0       6       NaN

In [63]:
df.dropna(axis=1)

   Hockey
0       1
1       2
2       4
3       5
4       6

In [65]:
df.fillna(1)

   Cricket  Hockey  FootBall
0      1.0       1       1.0
1      2.0       2       2.0
2      3.0       4       3.0
3      1.0       5       4.0
4      5.0       6       1.0

In [67]:
df.fillna(df['FootBall'].mean())

   Cricket  Hockey  FootBall
0      1.0       1       1.0
1      2.0       2       2.0
2      3.0       4       3.0
3      2.5       5       4.0
4      5.0       6       2.5

In [104]:
cust_df=pd.DataFrame({'CustomerId':['2','2','4','4','5'],'CustomerName':['Raju','Dhaymu','Manu','Suku','Vinu'],'Profit':[1000,322,556,678,900]})

In [105]:
df_g=cust_df.groupby('CustomerId')

In [106]:
df_g.mean()

            Profit
CustomerId
2              661
4              617
5              900

In [108]:
df_g.std(ddof=0)

            Profit
CustomerId
2            339.0
4             61.0
5              0.0

In [109]:
df_g.describe()

           Profit
            count   mean         std    min    25%    50%    75%     max
CustomerId
2             2.0  661.0  479.418398  322.0  491.5  661.0  830.5  1000.0
4             2.0  617.0   86.267027  556.0  586.5  617.0  647.5   678.0
5             1.0  900.0         NaN  900.0  900.0  900.0  900.0   900.0

In [110]:
df_g.count()

            CustomerName  Profit
CustomerId
2                      2       2
4                      2       2
5                      1       1

In [142]:
df1=pd.DataFrame({'CustomerId':['2','2','4','4','5'],'CustomerName':['Raju','Dhaymu','Manu','Suku','Vinu'],'Profit':[1000,322,556,678,900]})
df2=pd.DataFrame({'CustomerId':['2','2','4','4','6'],'CustomerName':['Raju','Dhaymu','Manu','Suku','Vinu'],'Profit':[100,32,55,67,90]})
df=pd.concat([df1,df2])

In [114]:
df_gr=df.groupby('CustomerId')

In [123]:
df_gr.count()

            CustomerName  Profit
CustomerId
2                      4       4
4                      4       4
5                      2       2

In [124]:
df_c=pd.concat([df1,df2],axis=1)

In [121]:
df_c

  CustomerId CustomerName  Profit CustomerId CustomerName  Profit
0          2         Raju    1000          2         Raju     100
1          2       Dhaymu     322          2       Dhaymu      32
2          4         Manu     556          4         Manu      55
3          4         Suku     678          4         Suku      67
4          5         Vinu     900          5         Vinu      90

In [145]:
pd.merge(df1,df2,how="left",on='CustomerId')

  CustomerId CustomerName_x  Profit_x CustomerName_y  Profit_y
0          2           Raju      1000           Raju     100.0
1          2           Raju      1000         Dhaymu      32.0
2          2         Dhaymu       322           Raju     100.0
3          2         Dhaymu       322         Dhaymu      32.0
4          4           Manu       556           Manu      55.0
5          4           Manu       556           Suku      67.0
6          4           Suku       678           Manu      55.0
7          4           Suku       678           Suku      67.0
8          5           Vinu       900            NaN       NaN

In [149]:
df.apply(len)

CustomerId      10
CustomerName    10
Profit          10
dtype: int64

In [150]:
df['Profit'].sum()

3800

In [154]:
df['Profit'].value_counts()

556     1
90      1
1000    1
55      1
678     1
900     1
67      1
322     1
100     1
32      1
Name: Profit, dtype: int64

In [155]:
df.index

Int64Index([0, 1, 2, 3, 4, 0, 1, 2, 3, 4], dtype='int64')

In [156]:
df.sort_values(by='Profit')

  CustomerId CustomerName  Profit
1          2       Dhaymu      32
2          4         Manu      55
3          4         Suku      67
4          6         Vinu      90
0          2         Raju     100
1          2       Dhaymu     322
2          4         Manu     556
3          4         Suku     678
4          5         Vinu     900
0          2         Raju    1000

In [157]:
df.isnull()

   CustomerId  CustomerName  Profit
0       False         False   False
1       False         False   False
2       False         False   False
3       False         False   False
4       False         False   False
0       False         False   False
1       False         False   False
2       False         False   False
3       False         False   False
4       False         False   False